
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.РЗ_Задачи") И НЕ ПараметрКоманды.Пустая() Тогда
		ПараметрыФормы = Новый Структура("Задача", ПараметрКоманды);
		ОткрытьФорму("РегистрСведений.РЗ_Хронометраж.Форма.ФормаВыполненияЗадачи", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры
