#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РЗ_ПланыЗанятий
	Движения.РЗ_ПланыЗанятий.Записывать = Истина;
	Для Каждого ТекСтрокаПланЗанятий Из ПланЗанятий Цикл
		Движение = Движения.РЗ_ПланыЗанятий.Добавить();
		Движение.Период = ДатаНачала;
		Движение.УченикГруппа = УченикГруппа;
		Движение.ДатаЗанятия = ТекСтрокаПланЗанятий.Дата;
		Движение.КоличествоЧасов = ТекСтрокаПланЗанятий.КоличествоЧасов;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецЕсли